Autodesk.Revit.DB.FilteredWorksetIterator.CurrentObject
Gets the item at the current position of the iterator.(Inherited from IEnumerator. Give it another property name to avoid confusing. And make it internal.)

Autodesk.Revit.DB.FilteredWorksetIterator.Current
Gets the item at the current position of the iterator.
Remarks: There is no current item if the iterator has not started yet or has been done.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  There is no current item in the iterator.

Autodesk.Revit.DB.FilteredWorksetIterator.Reset
Resets the iterator to the beginning.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The FilteredWorksetCollector that yielded this iterator has been reset by another operation.
No further iteration is permitted with this iterator.
Since:
2012

Autodesk.Revit.DB.FilteredWorksetIterator.IsDone
Identifies if the iteration has completed.
Returns:
True if the iteration has no more matching worksets.  False if there are more worksets to be iterated.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The FilteredWorksetCollector that yielded this iterator has been reset by another operation.
No further iteration is permitted with this iterator.
Since:
2012

Autodesk.Revit.DB.FilteredWorksetIterator.MoveNext
Increments the iterator to the next workset passing the filter.
Returns:
True if there is another available workset passing the filter in this iterator.
False if the iterator has completed all available worksets.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The FilteredWorksetCollector that yielded this iterator has been reset by another operation.
No further iteration is permitted with this iterator.
Since:
2012

Autodesk.Revit.DB.FilteredWorksetIterator.GetCurrent
The current workset found by the iterator.
Returns:
The workset.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There are no more worksets in the iterator.
-or-
The FilteredWorksetCollector that yielded this iterator has been reset by another operation.
No further iteration is permitted with this iterator.
Since:
2012

Autodesk.Revit.DB.FilteredWorksetIterator.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FilteredWorksetIterator
An iterator to a set of worksets filtered by the settings of a FilteredWorksetCollector.
Since:
2012